billing/tests/banks/party_raiff/fixtures/statement/statement_intraday.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns1:getRequestStatusResponse xmlns:ns1="http://upg.sbns.bssys.com/"><return xmlns="http://upg.sbns.bssys.com/">&lt;upg:Response xmlns:upg=&quot;http://bssys.com/upg/response&quot; xmlns:upgRaifUPGCustom=&quot;http://bssys.com/upg/response/RaifUPGCustom&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; createTime=&quot;2017-10-10T18:59:03&quot; requestId=&quot;998eb68a-70ad-4409-9838-be8f8d1646c9&quot; responseId=&quot;d5454355-74aa-4749-bfd0-d2ce956706f1&quot; sender=&quot;DBO&quot; version=&quot;1.1&quot;&gt;&#xD;
    &lt;upg:StatementsRaif&gt;&#xD;
        &lt;upg:StatementRaif acc=&quot;30601810800000000006&quot; acceptDate=&quot;2017-10-10&quot; beginDate=&quot;2017-10-10&quot; bic=&quot;044525700&quot; creditSum=&quot;5&quot; creditSumNat=&quot;0&quot; currCode=&quot;810&quot; debetSum=&quot;4&quot; debetSumNat=&quot;0&quot; docDate=&quot;2017-10-10&quot; docNum=&quot;4&quot; docTime=&quot;15:03:25&quot; extId=&quot;10c69caa-460a-4912-8bf0-8f37391245ca&quot; ldgBalance=&quot;0&quot; outBal=&quot;4000&quot; stmtDate=&quot;2017-10-10&quot; stmtType=&quot;0&quot;&gt;&#xD;
            &lt;upg:Docs&gt;&#xD;
                &lt;upg:TransInfo bank=&quot;Московский филиал АО &amp;quot;Райффайзенбанк&amp;quot;&quot; corrAcc=&quot;40702810023000404101&quot; corrBIC=&quot;042202847&quot; dc=&quot;1&quot; docDate=&quot;2017-10-10&quot; docNum=&quot;1&quot; docSum=&quot;5&quot; docSumNat=&quot;0&quot; extId=&quot;149b5cbc-3849-4891-bf64-f3fdbdcbc8e5&quot; operDate=&quot;2017-10-10&quot; payerBankBic=&quot;044525700&quot; payerBankCorrAccount=&quot;30101810200000000700&quot; paymentOrder=&quot;5&quot; personalAcc=&quot;30601810800000000006&quot; personalINN=&quot;7736207543&quot; personalKPP=&quot;770401001&quot; receiptDate=&quot;2017-10-10&quot; receiptName=&quot;ИП Кашкарова Дарья Александровна&quot; receiverBankCorrAccount=&quot;30101810300000000847&quot; receiverBankName=&quot;ПОВОЛЖСКИЙ ФИЛИАЛ АО &amp;quot;РАЙФФАЙЗЕНБАНК&amp;quot;, Г. НИЖНИЙ НОВГОРОД&quot; receiverINN=&quot;6316041540&quot; transKind=&quot;01&quot;&gt;&#xD;
                    &lt;upg:PersonalName&gt;ООО ЯНДЕКС &lt;/upg:PersonalName&gt;&#xD;
                    &lt;upg:Purpose&gt;Оплата за услуги дизайна по договору № 11 от 7 февраля 2015 года по счету № 9 от 25 мая 2015 года.&lt;/upg:Purpose&gt;&#xD;
                    &lt;upg:DepartmentalInfo cbc=&quot;&quot;/&gt;&#xD;
                &lt;/upg:TransInfo&gt;&#xD;
                &lt;upg:TransInfo bank=&quot;АО АКБ &amp;quot;ГАЗБАНК&amp;quot;, Г. САМАРА&quot; corrAcc=&quot;30601810800000000006&quot; corrBIC=&quot;044525700&quot; dc=&quot;2&quot; docNum=&quot;2&quot; docSum=&quot;1&quot; docSumNat=&quot;0&quot; extId=&quot;94f2bbbd-137c-4d96-aa7c-12bd91152c43&quot; operDate=&quot;2017-10-10&quot; payerBankBic=&quot;043601863&quot; payerBankCorrAccount=&quot;30101810400000000863&quot; paymentOrder=&quot;5&quot; personalAcc=&quot;40702810100020001384&quot; personalINN=&quot;6317084970&quot; personalKPP=&quot;633001001&quot; receiptDate=&quot;2017-10-10&quot; receiptName=&quot;ООО ЯНДЕКС&quot; receiverBankCorrAccount=&quot;30101810200000000700&quot; receiverBankName=&quot;АО &amp;quot;РАЙФФАЙЗЕНБАНК&amp;quot;, Г. МОСКВА&quot; receiverINN=&quot;7736207543&quot; receiverKPP=&quot;770401001&quot; transKind=&quot;01&quot;&gt;&#xD;
                    &lt;upg:PersonalName&gt;ООО &quot;Коммунальная система&quot;&lt;/upg:PersonalName&gt;&#xD;
                    &lt;upg:Purpose&gt;Оплата за обслуживание 1С по сч. N 56 от 30.04.2015 г.Сумма 2000-00Без налога (НДС)&lt;/upg:Purpose&gt;&#xD;
                    &lt;upg:DepartmentalInfo cbc=&quot;&quot;/&gt;&#xD;
                &lt;/upg:TransInfo&gt;&#xD;
                &lt;upg:TransInfo bank=&quot;ПОВОЛЖСКИЙ БАНК ПАО СБЕРБАНК, Г. САМАРА&quot; corrAcc=&quot;30601810800000000006&quot; corrBIC=&quot;044525700&quot; dc=&quot;2&quot; docDate=&quot;2017-10-10&quot; docNum=&quot;3&quot; docSum=&quot;3&quot; docSumNat=&quot;0&quot; extId=&quot;3b2b81d6-7e05-4a71-904a-36b0fba5e731&quot; operDate=&quot;2017-10-10&quot; payerBankBic=&quot;043601607&quot; payerBankCorrAccount=&quot;30101810200000000607&quot; paymentOrder=&quot;5&quot; personalAcc=&quot;40703810654400099854&quot; personalINN=&quot;6316161781&quot; personalKPP=&quot;631601001&quot; receiptDate=&quot;2017-10-10&quot; receiptName=&quot;ООО ЯНДЕКС&quot; receiverBankCorrAccount=&quot;30101810200000000700&quot; receiverBankName=&quot;АО &amp;quot;РАЙФФАЙЗЕНБАНК&amp;quot;, Г. МОСКВА&quot; receiverINN=&quot;7736207543&quot; receiverKPP=&quot;770401001&quot; transKind=&quot;01&quot;&gt;&#xD;
                    &lt;upg:PersonalName/&gt;&#xD;
                    &lt;upg:Purpose&gt;Оплата по счету № 66 от 30.04.2015г., обслуживание 1СПредприятие НДС не облагается&lt;/upg:Purpose&gt;&#xD;
                    &lt;upg:DepartmentalInfo cbc=&quot;&quot;/&gt;&#xD;
                &lt;/upg:TransInfo&gt;&#xD;
            &lt;/upg:Docs&gt;&#xD;
            &lt;upg:Signs&gt;&#xD;
                &lt;upg:Sign&gt;&#xD;
                    &lt;upg:Issuer&gt;E=ca@raiffeisen.ru, C=RU, L=Moscow, O=Raiffeisenbank, OU=ISD, CN=Raiffeisenbank Test Sub CA&lt;/upg:Issuer&gt;&#xD;
                    &lt;upg:SN&gt;6805AD5100010000142B&lt;/upg:SN&gt;&#xD;
                    &lt;upg:Value&gt;MIICiwYJKoZIhvcNAQcCoIICfDCCAngCAQExDDAKBgYqhQMCAgkFADALBgkqhkiG9w0BBwExggJWMIICUgIBATCBmjCBizEfMB0GCSqGSIb3DQEJARYQY2FAcmFpZmZlaXNlbi5ydTELMAkGA1UEBhMCUlUxDzANBgNVBAcTBk1vc2NvdzEXMBUGA1UEChMOUmFpZmZlaXNlbmJhbmsxDDAKBgNVBAsTA0lTRDEjMCEGA1UEAxMaUmFpZmZlaXNlbmJhbmsgVGVzdCBTdWIgQ0ECCmgFrVEAAQAAFCswCgYGKoUDAgIJBQCgggFUMBgGCSqGSIb3DQEJAzELBgkqhkiG9w0BBwEwHAYJKoZIhvcNAQkFMQ8XDTE4MDgxMzE1NTkwNVowLwYJKoZIhvcNAQkEMSIEIG9fjfOrdACI64HWVhdNjKayYocW9i9u9G6RKyfcq3niMIHoBgsqhkiG9w0BCRACLzGB2DCB1TCB0jCBzzAIBgYqhQMCAgkEIJY64RfsNtHvuDng/uEdfnHqmSBmAiq7MdoHx1tEYlUJMIGgMIGRpIGOMIGLMR8wHQYJKoZIhvcNAQkBFhBjYUByYWlmZmVpc2VuLnJ1MQswCQYDVQQGEwJSVTEPMA0GA1UEBxMGTW9zY293MRcwFQYDVQQKEw5SYWlmZmVpc2VuYmFuazEMMAoGA1UECxMDSVNEMSMwIQYDVQQDExpSYWlmZmVpc2VuYmFuayBUZXN0IFN1YiBDQQIKaAWtUQABAAAUKzAKBgYqhQMCAhMFAARATUYVz6drrlOyUrT2VadlP0K2788uurrHoLDyXoe3ICcsPtqicU/yf9HKpGb2RNklZf40Bn43wG38F4Eg73uNvQ==&lt;/upg:Value&gt;&#xD;
                    &lt;upg:DigestName&gt;com.bssys.sbns.dbo.rur.statement.R020UPGSignDigest&lt;/upg:DigestName&gt;&#xD;
                    &lt;upg:DigestVersion&gt;4&lt;/upg:DigestVersion&gt;&#xD;
                    &lt;upg:SignType&gt;BANK_ENGINE&lt;/upg:SignType&gt;&#xD;
                &lt;/upg:Sign&gt;&#xD;
            &lt;/upg:Signs&gt;&#xD;
        &lt;/upg:StatementRaif&gt;&#xD;
    &lt;/upg:StatementsRaif&gt;&#xD;

&lt;upg:LettersFromBank&gt;
&lt;upg:LetterFromBank docExtId=&quot;41641f1b-812d-4d71-adc3-ffe236f04396&quot;&gt;
    &lt;upg:DocData bankName=&quot;somename&quot; docDate=&quot;2021-03-19&quot; docNum=&quot;25962&quot;&gt;
    &lt;upg:OrgData extID=&quot;4366b1d0-304a-4522-91d4-a47e829aa067&quot; inn=&quot;6232008000&quot; kpp=&quot;623401000&quot;&gt;
        &lt;upg:Name&gt;ООО TTTTT&lt;/upg:Name&gt;
    &lt;/upg:OrgData&gt;
    &lt;/upg:DocData&gt;
    &lt;upg:Type&gt;Письмо&lt;/upg:Type&gt;
    &lt;upg:Theme&gt;Ответ на запрос справки&lt;/upg:Theme&gt;
    &lt;upg:AddInfo&gt;Уважаемый Клиент, добрый день!
        Направляем справку по Вашему запросу.
        С уважением.
    &lt;/upg:AddInfo&gt;
    &lt;upg:Attachments&gt;
        &lt;upg:Attachment&gt;
            &lt;upg:AttachmentName&gt;100_CAETRQ_RBA_19.03.2021_1.pdf&lt;/upg:AttachmentName&gt;
            &lt;upg:Body&gt;ZGF0YTE=&lt;/upg:Body&gt;
        &lt;/upg:Attachment&gt;
    &lt;/upg:Attachments&gt;
    &lt;upg:MustRead&gt;1&lt;/upg:MustRead&gt;
    &lt;upg:AccNum&gt;30601810800000000006&lt;/upg:AccNum&gt;
&lt;/upg:LetterFromBank&gt;

&lt;upg:LetterFromBank docExtId=&quot;41641f1b-812d-4d71-adc3-ffe236f04300&quot;&gt;
    &lt;upg:DocData bankName=&quot;somename&quot; docDate=&quot;2021-03-19&quot; docNum=&quot;25963&quot;&gt;
    &lt;upg:OrgData extID=&quot;4366b1d0-304a-4522-91d4-a47e829aa000&quot; inn=&quot;6232008000&quot; kpp=&quot;623401000&quot;&gt;
        &lt;upg:Name&gt;ООО TTTTT&lt;/upg:Name&gt;
    &lt;/upg:OrgData&gt;
    &lt;/upg:DocData&gt;
    &lt;upg:Type&gt;Письмо&lt;/upg:Type&gt;
    &lt;upg:Theme&gt;Ответ на запрос справки&lt;/upg:Theme&gt;
    &lt;upg:AddInfo&gt;Уважаемый Клиент, добрый день!&lt;/upg:AddInfo&gt;
    &lt;upg:Attachments&gt;
        &lt;upg:Attachment&gt;
            &lt;upg:AttachmentName&gt;some.pdf&lt;/upg:AttachmentName&gt;
            &lt;upg:Body&gt;ZGF0YTE=&lt;/upg:Body&gt;
        &lt;/upg:Attachment&gt;
    &lt;/upg:Attachments&gt;
    &lt;upg:MustRead&gt;0&lt;/upg:MustRead&gt;
&lt;/upg:LetterFromBank&gt;
&lt;/upg:LettersFromBank&gt;

&lt;/upg:Response&gt;&#xD;
</return></ns1:getRequestStatusResponse></soap:Body></soap:Envelope>
